let text = ["Вычита́ние — одна из вспомогательных  математических операций двух чисел, результатом которой является новое число, получаемое уменьшением значения первого числа на значение второго числа",
"Сложе́ние — одна из основных математических операций двух чисел, результатом которой является новое число, получаемое увеличением значения первого числа на значение второго числа.", "Умноже́ние — одна из основных математических операций над двумя числами, которые называются множителями или сомножителями.", "Деле́ние — действие, обратное умножению. Деление обозначается двоеточием, обелюсом, косой чертой или записывается в виде дроби."];

let button1 = document.querySelector('.btn');    
let Theory = document.querySelector('.Theory');
let counter = 0;
alert(Theory)

button1.addEventListener('click', function() {    
    Theory.innerHTML = text[counter];
    counter = counter + 1;
    counter = counter % 4
});
